pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi.h
/*
 * Copyright(c) 2007 - 2016 Realtek Corporation. All rights reserved.
 * SPDX-License-Identifier: Apache-2.0
 * Licensed under the Apache License, Version 2.0 (the License); you may
 * not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 * http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an AS IS BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * @file     rtl8710c_dpi.h
 * @brief    CMSIS HeaderFile
 * @version  1.0
 * @date     08. December 2017
 * @note     Generated by SVDConv V3.3.9 on Friday, 08.12.2017 17:07:37
 *           from File 'rtl8195b-hp-dpi.svd',
 *           last modified on Friday, 08.12.2017 09:06:14
 */


#ifndef RTL8710C_DPI_H
#define RTL8710C_DPI_H

#ifdef __cplusplus
extern "C" {
#endif


/* =========================================================================================================================== */
/* ================                                            DPI                                            ================ */
/* =========================================================================================================================== */

/// @cond DOXYGEN_GENERAL_REG_TYPE || DOXYGEN_DPI_REG_TYPE

/** @addtogroup dpi_peripherals DDR Phy. Registers
  * @ingroup hs_hal_psram
  * @{
  */

/**
  * @brief DDR PHY IP (DPI)
  */

typedef struct {                                /*!< (@ 0x40402000) DPI Structure                                              */

  union {
    __IOM uint32_t crt_ctl;                     /*!< (@ 0x00000000) CRT Control Register                                       */

    struct {
      __IM  uint32_t            : 1;
      __IOM uint32_t dpi_ddr2_en : 1;           /*!< [1..1] DDR2 Enable                                                        */
      __IOM uint32_t dpi_dat_rate_sel : 1;      /*!< [2..2] DFI Data ratio selection 1 : data ratio 1 : 1 0 : data
                                                     ratio 1 : 2                                                               */
      __IOM uint32_t dpi_adr_rate_sel : 1;      /*!< [3..3] DFI Address/Command ratio selection 1 : data ratio 1
                                                     : 1 0 : data ratio 1 : 2                                                  */
      __IOM uint32_t pin_mux_mode : 1;          /*!< [4..4] 1 : LPDDR1 0 : PSRAM                                               */

      __IM  uint32_t            : 1;
      __IOM uint32_t dpi_dqx2_clk_sel : 1;      /*!< [6..6] select dq clock source: 1: dqsx2 , 0: dqx2                         */
      __IOM uint32_t dpi_psram_clk_sel : 1;     /*!< [7..7] select PSRAM clock source 1 : mck_cmd only 0 : mck_ck
                                                     / mck_cmd / mck_dqs / mck_dq                                              */
      __IOM uint32_t bypass_pll_test_mode : 1;  /*!< [8..8] Bypass PLL clock. If bypass_pll_test_mode = 1, bypass_pll_ref_clk_mode
                                                     = 0, clock from bypass_pll_test_clk. bypass_pll_ref_clk_mode
                                                     = 1, clock from PLL reference clock.                                      */
      __IOM uint32_t bypass_pll_ref_clk_mode : 1;/*!< [9..9] Clock selection when bypass_pll_test_mode enable.                 */

      __IM  uint32_t            : 2;
      __IOM uint32_t pwdpad     : 1;            /*!< [12..12] 1 : PAD power down 0 : PAD power on                              */
    } crt_ctl_b;
  } ;

  union {
    __IOM uint32_t pll_ctl0;                    /*!< (@ 0x00000004) PLL Control Register 0                                     */

    struct {
      __IOM uint32_t dpi_en_post_pi : 12;       /*!< [11..0] Enable PLL phase selecter                                         */
      __IOM uint32_t dpi_pll_sel_cpmode : 1;    /*!< [12..12] PLL charge pump mode selector                                    */

      __IM  uint32_t            : 3;
      __IOM uint32_t dpi_mck_clk_en : 11;       /*!< [26..16] ck_en[10 :0] :clock enable ck_en[0] :mck_ck ck_en[1]
                                                     :mck_cmd ck_en[2]:mck_dqs_0 ck_en[3]:mck_dqs_1 ck_en[4]:mck_dqs_2
                                                     ck_en[5]:mck_dqs_3 ck_en[6]: mck_dq_0 ck_en[7]: mck_dq_1
                                                     ck_en[8]: mck_dq_2 ck_en[9]: mck_dq_3 ck_en[10]:mck_ck_1                  */
    } pll_ctl0_b;
  } ;

  union {
    __IOM uint32_t pll_ctl1;                    /*!< (@ 0x00000008) PLL Control Register 1                                     */

    struct {
      __IOM uint32_t dpi_oesync_op_sel : 11;    /*!< [10..0] control signal for output clock enable sync                       */

      __IM  uint32_t            : 5;
      __IOM uint32_t dpi_clk_oe : 11;           /*!< [26..16] clk_oe[10:0]: PLL clock output enable clk_oe[0]:mck_ck
                                                     clk_oe[1]:mck_cmd clk_oe[2]:mck_dqs_0 clk_oe[3]:mck_dqs_1
                                                     clk_oe[4]:mck_dqs_2 clk_oe[5]:mck_dqs_3 clk_oe[6]:mck_dq_0
                                                     clk_oe[7]:mck_dq_1 clk_oe[8]:mck_dq_2 clk_oe[9]:mck_dq_3
                                                     clk_oe[10]:mck_ck_1                                                       */
    } pll_ctl1_b;
  } ;

  union {
    __IOM uint32_t pll_ctl2;                    /*!< (@ 0x0000000C) PLL Control Register 2                                     */

    struct {
      __IOM uint32_t dpi_pll_dum : 8;           /*!< [7..0] dpi_pll_dum                                                        */
    } pll_ctl2_b;
  } ;

  union {
    __IOM uint32_t pll_pi0;                     /*!< (@ 0x00000010) PLL PI0 Register                                           */

