pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi.h
    struct {
      __IOM uint32_t wrlvl_rddata : 32;         /*!< [31..0] Read data from DDR when wrlvl_en is high                          */
    } wrlvl_rd_data_b;
  } ;

  union {
    __IOM uint32_t test_ctrl0;                  /*!< (@ 0x00000230) TEST_CTRL0 Register                                        */

    struct {
      __IOM uint32_t rd_dbg_sel0_0 : 5;         /*!< [4..0] Debug selection for data slice0                                    */
      __IOM uint32_t rd_dbg_sel0_1 : 5;         /*!< [9..5] Debug selection for data slice1                                    */
      __IOM uint32_t rd_dbg_sel0_2 : 5;         /*!< [14..10] Debug selection for data slice2                                  */
      __IOM uint32_t rd_dbg_sel0_3 : 5;         /*!< [19..15] Debug selection for data slice3                                  */
      __IOM uint32_t rw_dbg_sel0 : 2;           /*!< [21..20] Debug selection for read / write slice top                       */
      __IOM uint32_t top_dbg_sel : 2;           /*!< [23..22] Debug selection for top                                          */
      __IOM uint32_t dbg_pcmd_out : 1;          /*!< [24..24] Debug output from CMD PAD                                        */

      __IM  uint32_t            : 5;
      __IOM uint32_t lbk_mode   : 2;            /*!< [31..30] Self look back mode                                              */
    } test_ctrl0_b;
  } ;

  union {
    __IOM uint32_t test_ctrl1;                  /*!< (@ 0x00000234) TEST_CTRL1 Register                                        */

    struct {
      __IOM uint32_t rd_dbg_sel1_0 : 5;         /*!< [4..0] Debug selection for data slice0                                    */
      __IOM uint32_t rd_dbg_sel1_1 : 5;         /*!< [9..5] Debug selection for data slice1                                    */
      __IOM uint32_t rd_dbg_sel1_2 : 5;         /*!< [14..10] Debug selection for data slice2                                  */
      __IOM uint32_t rd_dbg_sel1_3 : 5;         /*!< [19..15] Debug selection for data slice3                                  */
      __IOM uint32_t rw_dbg_sel1 : 2;           /*!< [21..20] Debug selection for read / write slice top                       */
    } test_ctrl1_b;
  } ;

  union {
    __IOM uint32_t dq_dly0;                     /*!< (@ 0x00000238) DQ_DLY Register 0                                          */

    struct {
      __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
      __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
      __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
      __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
      __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
      __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
      __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
      __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
    } dq_dly0_b;
  } ;

  union {
    __IOM uint32_t dq_dly0_1;                   /*!< (@ 0x0000023C) DQ_DLY Register 0_1                                        */

    struct {
      __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
      __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
      __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
      __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
      __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
      __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
      __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
      __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
    } dq_dly0_1_b;
  } ;

  union {
    __IOM uint32_t dq_dly0_2;                   /*!< (@ 0x00000240) DQ_DLY Register 0_2                                        */

    struct {
      __IOM uint32_t dq0_dly_sel : 4;           /*!< [3..0] DQ[0] delay chain control                                          */
      __IOM uint32_t dq1_dly_sel : 4;           /*!< [7..4] DQ[1] delay chain control                                          */
      __IOM uint32_t dq2_dly_sel : 4;           /*!< [11..8] DQ[2] delay chain control                                         */
      __IOM uint32_t dq3_dly_sel : 4;           /*!< [15..12] DQ[3] delay chain control                                        */
      __IOM uint32_t dq4_dly_sel : 4;           /*!< [19..16] DQ[4] delay chain control                                        */
      __IOM uint32_t dq5_dly_sel : 4;           /*!< [23..20] DQ[5] delay chain control                                        */
      __IOM uint32_t dq6_dly_sel : 4;           /*!< [27..24] DQ[6] delay chain control                                        */
      __IOM uint32_t dq7_dly_sel : 4;           /*!< [31..28] DQ[7] delay chain control                                        */
    } dq_dly0_2_b;
  } ;

  union {
    __IOM uint32_t dq_dly0_3;                   /*!< (@ 0x00000244) DQ_DLY Register 0_3                                        */

