pammyleong/Arduino_AmebaD_test/AmebaPro2/Package/hardware/system/component/soc/8710c/fwlib/lib/include/rtl8710c_dpi.h
    struct {
      __IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
      __IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
      __IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
    } read_ctrl2_0_b;
  } ;

  union {
    __IOM uint32_t read_ctrl2_1;                /*!< (@ 0x0000026C) Read Control Register 2_1                                  */

    struct {
      __IOM uint32_t tm_odt_en  : 22;           /*!< [21..0] odt_en when read delay                                            */
      __IOM uint32_t odt_force_sig : 1;         /*!< [22..22] If set odt_force_sel, TE is controlled by odt_force_sig.         */
      __IOM uint32_t odt_force_sel : 1;         /*!< [23..23] ODT pad control.                                                 */
    } read_ctrl2_1_b;
  } ;
  __IM  uint32_t  RESERVED6[18];

  union {
    __IOM uint32_t dqs_in_dly_0;                /*!< (@ 0x000002B8) DQS In Delay Register 0                                    */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
    } dqs_in_dly_0_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_0_1;              /*!< (@ 0x000002BC) DQS In Delay Register 0_1                                  */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
    } dqs_in_dly_0_1_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_0_2;              /*!< (@ 0x000002C0) DQS In Delay Register 0_2                                  */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
    } dqs_in_dly_0_2_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_0_3;              /*!< (@ 0x000002C4) DQS In Delay Register 0_3                                  */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_0 : 5;   /*!< [4..0] DQS_IN[0] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_1 : 5;   /*!< [12..8] DQS_IN[1] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_2 : 5;   /*!< [20..16] DQS_IN[2] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_3 : 5;   /*!< [28..24] DQS_IN[3] raising edge delay chain control                       */
    } dqs_in_dly_0_3_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_1;                /*!< (@ 0x000002C8) DQS In Delay Register 1                                    */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
    } dqs_in_dly_1_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_1_1;              /*!< (@ 0x000002CC) DQS In Delay Register 1_1                                  */

    struct {
      __IOM uint32_t fw_rd_dly_pos_sel_4 : 5;   /*!< [4..0] DQS_IN[4] raising edge delay chain control                         */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_5 : 5;   /*!< [12..8] DQS_IN[5] raising edge delay chain control                        */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_6 : 5;   /*!< [20..16] DQS_IN[6] raising edge delay chain control                       */

      __IM  uint32_t            : 3;
      __IOM uint32_t fw_rd_dly_pos_sel_7 : 5;   /*!< [28..24] DQS_IN[7] raising edge delay chain control                       */
    } dqs_in_dly_1_1_b;
  } ;

  union {
    __IOM uint32_t dqs_in_dly_1_2;              /*!< (@ 0x000002D0) DQS In Delay Register 1_2                                  */

